# Mapping

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from pandas import Series,DataFrame

In [5]:
from numpy.random import randn

In [39]:
a=DataFrame({'Name':['ganesh','palash','rashmi'],'Weight':[40,50,100]})

In [40]:
a

     Name  Weight
0  ganesh      40
1  palash      50
2  rashmi     100

In [28]:
height_map={'ganesh':20,'palash':100,'rashmi':30}

In [29]:
height_map

{'ganesh': 20, 'palash': 100, 'rashmi': 30}

In [30]:
a['height']=a['Name'].map(height_map)

In [31]:
a

     Name  Weight  height
0  ganesh      40      20
1  palash      50     100
2  rashmi     100      30

In [41]:
a['Height']=a['Weight'].map(height_map)

In [42]:
a

     Name  Weight  Height
0  ganesh      40     NaN
1  palash      50     NaN
2  rashmi     100     NaN

# Replace

In [37]:
b=Series([1,2,3,4,1,2,3,4])

In [38]:
b

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [43]:
b.replace(1,np.nan)                                   #............1

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [44]:
b.replace([1,4],[10,40])                              #.............2

0    10
1     2
2     3
3    40
4    10
5     2
6     3
7    40
dtype: int64

In [46]:
b.replace({1:np.nan,2:3})                             #.............3

0    NaN
1    3.0
2    3.0
3    4.0
4    NaN
5    3.0
6    3.0
7    4.0
dtype: float64

# Rename index

In [48]:
a=DataFrame(np.arange(12).reshape(3,4),index=['NY','LA','SF'],columns=['A','B','C','D'])

In [49]:
a

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [50]:
a.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [52]:
a.index=a.index.map(str.lower)

In [53]:
a

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [55]:
a.rename(index=str.title,columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [56]:
a

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [60]:
a.index=(index=str.title,columns=str.lower)           # to be done....pending

SyntaxError: invalid syntax (2221883496.py, line 1)

In [76]:
 a.rename(index={'ny':'New York'},columns={'A':'Alpha'},inplace=True)           #inplace causes change in original datafrane

In [78]:
a

          alpha  B   C   D
New YOrk      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

# Import csv file

In [12]:
df=pd.read_csv('//Users/donetra/Downloads/Salary_Data.csv')                     #Salary_Data.csv

In [ ]:
#for name,we need to upload the file in jupiter notebook folder and copy paste the name in string

In [13]:
df.head()     #shows the first five records

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [14]:
df.tail()    #shows the last five records

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [ ]:
#we cant use df directly as it will hang the system, so we use head or tail to work on first or last five records

In [6]:
df=pd.read_csv('Salary_Data.csv')                               #Salary_Data.csv

In [7]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [8]:
df['YearsExperience']

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: YearsExperience, dtype: float64

In [9]:
df['YearsExperience']>=5

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16     True
17     True
18     True
19     True
20     True
21     True
22     True
23     True
24     True
25     True
26     True
27     True
28     True
29     True
Name: YearsExperience, dtype: bool

In [10]:
for i in df['YearsExperience']:
    print(i,i>=5)

1.1 False
1.3 False
1.5 False
2.0 False
2.2 False
2.9 False
3.0 False
3.2 False
3.2 False
3.7 False
3.9 False
4.0 False
4.0 False
4.1 False
4.5 False
4.9 False
5.1 True
5.3 True
5.9 True
6.0 True
6.8 True
7.1 True
7.9 True
8.2 True
8.7 True
9.0 True
9.5 True
9.6 True
10.3 True
10.5 True

In [11]:
a=df[df['YearsExperience']>=5]
a

    YearsExperience    Salary
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [12]:
min(a['Salary'])

66029.0

In [13]:
min(df['Salary'])

37731.0

In [14]:
a.describe()

       YearsExperience         Salary
count        14.000000      14.000000
mean          7.850000  101316.071429
std           1.838373   16666.412550
min           5.100000   66029.000000
25%           6.200000   92288.500000
50%           8.050000  103442.000000
75%           9.375000  113517.750000
max          10.500000  122391.000000

In [15]:
df.nunique()

YearsExperience    28
Salary             30
dtype: int64